docs/Emacs-regexp.org
#+title: ELisp 中的正则表达式 (regexp)

* Syntax

字符分为两类.  一类是 /ordinary/ 的; 除此以外皆为 special construct:
- [[‘​=.=​’][‘​=.=​’]], [[‘​=*=​’][‘​=*=​’]], [[‘​=+=​’, ‘​=?=​’][‘​=+=​’]], [[‘​=+=​’, ‘​=?=​’][‘​=?=​’]], [[‘​=\[...\]=​’][‘​=[=​’]], [[‘​=^=​’][‘​=^=​’]], [[‘​=$=​’][‘​=$=​’]], [[‘​=\=​’][‘​=\=​’]];[fn::未来不会有新增的 special 字符.]
- [[‘​=\[...\]=​’][‘​=]=​’]], [[‘​=\[...\]=​’][‘​=-=​’]], [[Character Classes][‘​=[:=​’]]&[[Character Classes][‘​=:]=​’]] 有时特殊.
- 跟在 [[‘​=\=​’][‘​=\=​’]] 后的字符.

** Special Characters

*** ‘​=.=​’                                                         :construct:

匹配任何字符, *除了* newline.

*** ‘​=*=​’                                                  :postfix_operator:

/尽可能多地/ (0\tilde\infty) 重复前一个 /最小的/ regexp.

机制:
这个 matcher 先尽量多地重复前一个表达式, 当后续 regexp 匹配失败后再回溯.

*** ‘​=+=​’, ‘​=?=​’                                           :postfix_operator:

类似于 [[‘​=*=​’][‘​=*=​’]], 但
‘​=+=​’ /至少/ 匹配一次,
‘​=?=​’ /至多/ 匹配一次.

*** ‘​=*?=​’, ‘​=+?=​’, ‘​=??=​’                                 :postfix_operator:

分别是 [[‘​=*=​’][‘​=*=​’]], [[‘​=+=​’, ‘​=?=​’][‘​=+=​’]], [[‘​=+=​’, ‘​=?=​’][‘​=?=​’]] 的 /non-greedy/ 变体.
它们 /尽可能少地/ 重复.

*** ‘​=[...]=​’                                         :character_alternative:

最简单地用例:
匹配被方括号包围的字符; ‘​=[^...]=​’ 匹配没有被包围的字符.

可以用 ‘​=-=​’ 构造一个 range, e.g., =[a-z.]= 匹配 任何小写字母 或 句点.  \\
下界比上界大的 range 实际上是空的, 它不代表任何字符.
因此, =[z-a]=[fn::如果你意在编写一个空的 range, 那么就应该使用这个例子, 因为其它写法容易被误认为是 typo.] 总是匹配失败, 而 =[^z-a]= 总是匹配成功 (甚至包括 newline, 实际上这是 ‘​=[^...]=​’ 的 feature, 也是 ELisp 与 ~grep~ 的不同之处).

可以用 [[Character Classes][‘​=[:...:]=​’]] 构造一个 class[fn::该 feature 由 POSIX 标准指定.], e.g., =[[:lower:][:digit:]]= 匹配 任何小写字母 或 任何十进制数字.  \\
N.b., class 不应该作为 range 的边界.

在 ‘​=[...]=​’ 中, 只有如下字符是 special 的[fn::所以 [[‘​=\=​’][‘​=\=​’]] 无法转义下列字符, 因为在这里, 它不是 special 的.]:
- ‘​=]=​’ \\
  为了包含 ‘​=]=​’ 以匹配这个字符, 将其写在最前端: =[]123]=.
- ‘​=^=​’ \\
  仅当它是第一个字符时是 special 的, 此时, 它的后一个字符被看作是整个 ‘​=[^...]=​’ 的最前端.  \\
  为了包含它, 将其放在除了最前端以外的任何位置: =[12^ab]=.
- ‘​=-=​’ \\
  为了包含它, 将其写在尾端: =[123-]=.
因此, =[]^-]= 匹配以上三个字符.

*** ‘​=^=​’                                    :construct:matches_empty_string:

匹配 string 的 *行首* (或 buffer[fn:Emacs:这是 Emacs Lisp 相关的概念, 只学习 regexp 的话可以忽略.] 中可访问部分的起始端).

为了向后兼容 (historical compatibility), ‘​=^=​’ 只能用在:
- Regexp 的开头.
- 接在 [[‘​=\(...\)=​’][‘​=\(=​’]] 或 [[‘​=\(?:...\)=​’, ‘​=\(?=​/=num=/​=:...\)=​’][‘​=\(?:=​’]] 后面.
- 接在 [[‘​=\|=​’][‘​=\|=​’]] 后面.

*** ‘​=$=​’                                    :construct:matches_empty_string:

类似于 [[‘​=^=​’][‘​=^=​’]], 但是是用来匹配 *行尾*.

为了向后兼容, 只能用在:
- Regexp 的末尾.
- 接在 [[‘​=\(...\)=​’][‘​=\)=​’]] 后面.
- 接在 [[‘​=\|=​’][‘​=\|=​’]] 后面.

