docs/pages/Emacs-regexp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-24 周一 02:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ELisp 中的正则表达式 (regexp)</title>
<meta name="author" content="谢骐" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">ELisp 中的正则表达式 (regexp)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3f7f888">1. Syntax</a>
<ul>
<li><a href="#orga8761e7">1.1. Special Characters</a>
<ul>
<li><a href="#org1fae506">1.1.1. ‘​<code>.</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span></span></a></li>
<li><a href="#orgb841519">1.1.2. ‘​<code>*</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="postfix_operator">postfix_operator</span></span></a></li>
<li><a href="#orgfd0589d">1.1.3. ‘​<code>+</code>​’, ‘​<code>?</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="postfix_operator">postfix_operator</span></span></a></li>
<li><a href="#org9103e2c">1.1.4. ‘​<code>*?</code>​’, ‘​<code>+?</code>​’, ‘​<code>??</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="postfix_operator">postfix_operator</span></span></a></li>
<li><a href="#orga9232fd">1.1.5. ‘​<code>[...]</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="character_alternative">character_alternative</span></span></a></li>
<li><a href="#orgb1d2405">1.1.6. ‘​<code>^</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span>&#xa0;<span class="matches_empty_string">matches_empty_string</span></span></a></li>
<li><a href="#orgeb3d459">1.1.7. ‘​<code>$</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span>&#xa0;<span class="matches_empty_string">matches_empty_string</span></span></a></li>
<li><a href="#org4b21883">1.1.8. ‘​<code>\</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span></span></a></li>
</ul>
</li>
<li><a href="#org6d328b4">1.2. Character Classes</a>
<ul>
<li><a href="#orgaa6ab20">1.2.1. ‘​<code>[:ascii:]</code>​’, ‘​<code>[:nonascii:]</code>​’</a></li>
<li><a href="#org0ac51fc">1.2.2. ‘​<code>[:alnum:]</code>​’</a></li>
<li><a href="#orgdc418f7">1.2.3. ‘​<code>[:alpha:]</code>​’</a></li>
<li><a href="#org3d48354">1.2.4. ‘​<code>[:blank:]</code>​’</a></li>
<li><a href="#org8c5ad1f">1.2.5. ‘​<code>[:cntrl:]</code>​’</a></li>
<li><a href="#orgb113260">1.2.6. ‘​<code>[:digit:]</code>​’</a></li>
<li><a href="#orge127233">1.2.7. ‘​<code>[:graph:]</code>​’</a></li>
<li><a href="#org8f9309e">1.2.8. ‘​<code>[:lower:]</code>​’, ‘​<code>[:upper:]</code>​’</a></li>
<li><a href="#org7a72b5d">1.2.9. ‘​<code>[:multibyte:]</code>​’, ‘​<code>[:unibyte:]</code>​’</a></li>
<li><a href="#org4f00da8">1.2.10. ‘​<code>[:print:]</code>​’</a></li>
<li><a href="#orgbde43e0">1.2.11. ‘​<code>[:punct:]</code>​’</a></li>
<li><a href="#orgdf3d1d8">1.2.12. ‘​<code>[:space:]</code>​’</a></li>
<li><a href="#orgac4d3d5">1.2.13. ‘​<code>[:word:]</code>​’</a></li>
<li><a href="#org2c88999">1.2.14. ‘​<code>[:xdigit:]</code>​’</a></li>
</ul>
</li>
<li><a href="#orgbd79821">1.3. Backslash Constructs</a>
<ul>
<li><a href="#orge14c7cc">1.3.1. ‘​<code>\|</code>​’</a></li>
<li><a href="#org32a09a0">1.3.2. ‘​<code>\{</code>​<i><code>m</code></i>​<code>\}</code>​’</a></li>
<li><a href="#orgb9af621">1.3.3. ‘​<code>\{</code>​<i><code>m</code></i>​,​<i><code>n</code></i>​<code>\}</code>​’</a></li>
<li><a href="#org1eb9459">1.3.4. ‘​<code>\(...\)</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="group">group</span></span></a></li>
<li><a href="#org2f25296">1.3.5. ‘​<code>\(?:...\)</code>​’, ‘​<code>\(?</code>​<i><code>num</code></i>​<code>:...\)</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="group">group</span></span></a></li>
<li><a href="#orgc300926">1.3.6. ‘​<code>\</code>​<i><code>digit</code></i>​’</a></li>
<li><a href="#org604d180">1.3.7. ‘​<code>\w</code>​’, ‘​<code>\W</code>​’</a></li>
<li><a href="#org519697b">1.3.8. ‘​<code>\s</code>​<i><code>code</code></i>​’, ‘​<code>\S</code>​<i><code>code</code></i>​’</a></li>
<li><a href="#org698e339">1.3.9. ‘​<code>\c</code>​<i><code>c</code></i>​’, ‘​<code>\C</code>​<i><code>c</code></i>​’</a></li>
<li><a href="#org868ae02">1.3.10. ‘​<code>\`</code>​’, ‘​<code>\'</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></a></li>
<li><a href="#org262cb01">1.3.11. ‘​<code>\=</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></a></li>
<li><a href="#org1d0e6d8">1.3.12. ‘​<code>\b</code>​’, ‘​<code>\B</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></a></li>
<li><a href="#org6ccb0de">1.3.13. ‘​<code>\&lt;</code>​’, ‘​<code>\&gt;</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></a></li>
<li><a href="#org89ee492">1.3.14. ‘​<code>\_&lt;</code>​’, ‘​<code>\_&gt;</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2762395">2. 一个复杂的例子</a></li>
<li><a href="#org3a5c963">3. <code>rx</code>: 结构化 regexp 标记法</a>
<ul>
<li><a href="#orga85d0af">3.1. Constructs in <code>rx</code></a>
<ul>
<li><a href="#org4f43534">3.1.1. Literals</a></li>
<li><a href="#orgf8b9ace">3.1.2. Sequence and alternative</a></li>
<li><a href="#org454e95d">3.1.3. Repetition</a></li>
<li><a href="#orgac4047d">3.1.4. Matching single characters</a></li>
<li><a href="#org68b55f5">3.1.5. Character class</a></li>
<li><a href="#org7b7ee0a">3.1.6. Zero-width assertions</a></li>
<li><a href="#org53d3f47">3.1.7. Capture groups</a></li>
<li><a href="#org9d75fc0">3.1.8. Dynamic inclusion</a></li>
</ul>
</li>
<li><a href="#orgd6b4c3f">3.2. Functions &amp; macros using <code>rx</code></a>
<ul>
<li><a href="#org3db18b2">3.2.1. <code>rx</code> <i><code>&amp;rest</code> <code>rx-form</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="macro">macro</span></span></a></li>
<li><a href="#org105529b">3.2.2. <code>rx-to-string</code> <i><code>rx-expr</code> <code>&amp;optional</code> <code>no-group</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></a></li>
<li><a href="#org6b7e196">3.2.3. <code>pcase</code> <code>expression</code> <code>((rx</code> <i><code>rx-expr</code></i>​<code>...)</code> <code>body-forms...)...</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="macro">macro</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbe1f652">4. 相关函数</a>
<ul>
<li>
<ul>
<li><a href="#orga17e237">4.0.1. <code>regexp-quote</code> <i><code>string</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></a></li>
<li><a href="#org3770317">4.0.2. <code>regexp-opt</code> <i><code>strings</code> <code>&amp;optional</code> <code>paren</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></a></li>
<li><a href="#org8de844d">4.0.3. <code>regexp-opt-depth</code> <i><code>regexp</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></a></li>
<li><a href="#org852bfc0">4.0.4. <code>regexp-opt-charset</code> <i><code>chars</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></a></li>
<li><a href="#org0acf2cf">4.0.5. <code>regexp-unmatchable</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="variable">variable</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd5881b2">5. Suggestions on Optimization</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3f7f888" class="outline-2">
<h2 id="org3f7f888"><span class="section-number-2">1.</span> Syntax</h2>
<div class="outline-text-2" id="text-1">
<p>
字符分为两类.  一类是 <i>ordinary</i> 的; 除此以外皆为 special construct:
</p>
<ul class="org-ul">
<li><a href="#org1fae506">‘​<code>.</code>​’</a>, <a href="#orgb841519">‘​<code>*</code>​’</a>, <a href="#orgfd0589d">‘​<code>+</code>​’</a>, <a href="#orgfd0589d">‘​<code>?</code>​’</a>, <a href="#orga9232fd">‘​<code>[</code>​’</a>, <a href="#orgb1d2405">‘​<code>^</code>​’</a>, <a href="#orgeb3d459">‘​<code>$</code>​’</a>, <a href="#org4b21883">‘​<code>\</code>​’</a>;<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></li>
<li><a href="#orga9232fd">‘​<code>]</code>​’</a>, <a href="#orga9232fd">‘​<code>-</code>​’</a>, <a href="#org6d328b4">‘​<code>[:</code>​’</a>&amp;<a href="#org6d328b4">‘​<code>:]</code>​’</a> 有时特殊.</li>
<li>跟在 <a href="#org4b21883">‘​<code>\</code>​’</a> 后的字符.</li>
</ul>
</div>

<div id="outline-container-orga8761e7" class="outline-3">
<h3 id="orga8761e7"><span class="section-number-3">1.1.</span> Special Characters</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org1fae506" class="outline-4">
<h4 id="org1fae506"><span class="section-number-4">1.1.1.</span> ‘​<code>.</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span></span></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
匹配任何字符, <b>除了</b> newline.
</p>
</div>
</div>

<div id="outline-container-orgb841519" class="outline-4">
<h4 id="orgb841519"><span class="section-number-4">1.1.2.</span> ‘​<code>*</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="postfix_operator">postfix_operator</span></span></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<i>尽可能多地</i> (0~&infin;) 重复前一个 <i>最小的</i> regexp.
</p>

<p>
机制:
这个 matcher 先尽量多地重复前一个表达式, 当后续 regexp 匹配失败后再回溯.
</p>
</div>
</div>

<div id="outline-container-orgfd0589d" class="outline-4">
<h4 id="orgfd0589d"><span class="section-number-4">1.1.3.</span> ‘​<code>+</code>​’, ‘​<code>?</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="postfix_operator">postfix_operator</span></span></h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
类似于 <a href="#orgb841519">‘​<code>*</code>​’</a>, 但
‘​<code>+</code>​’ <i>至少</i> 匹配一次,
‘​<code>?</code>​’ <i>至多</i> 匹配一次.
</p>
</div>
</div>

<div id="outline-container-org9103e2c" class="outline-4">
<h4 id="org9103e2c"><span class="section-number-4">1.1.4.</span> ‘​<code>*?</code>​’, ‘​<code>+?</code>​’, ‘​<code>??</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="postfix_operator">postfix_operator</span></span></h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
分别是 <a href="#orgb841519">‘​<code>*</code>​’</a>, <a href="#orgfd0589d">‘​<code>+</code>​’</a>, <a href="#orgfd0589d">‘​<code>?</code>​’</a> 的 <i>non-greedy</i> 变体.
它们 <i>尽可能少地</i> 重复.
</p>
</div>
</div>

<div id="outline-container-orga9232fd" class="outline-4">
<h4 id="orga9232fd"><span class="section-number-4">1.1.5.</span> ‘​<code>[...]</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="character_alternative">character_alternative</span></span></h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
最简单地用例:
匹配被方括号包围的字符; ‘​<code>[^...]</code>​’ 匹配没有被包围的字符.
</p>

<p>
可以用 ‘​<code>-</code>​’ 构造一个 range, e.g., <code>[a-z.]</code> 匹配 任何小写字母 或 句点.  <br />
下界比上界大的 range 实际上是空的, 它不代表任何字符.
因此, <code>[z-a]</code><sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> 总是匹配失败, 而 <code>[^z-a]</code> 总是匹配成功 (甚至包括 newline, 实际上这是 ‘​<code>[^...]</code>​’ 的 feature, 也是 ELisp 与 <code>grep</code> 的不同之处).
</p>

<p>
可以用 <a href="#org6d328b4">‘​<code>[:...:]</code>​’</a> 构造一个 class<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>, e.g., <code>[[:lower:][:digit:]]</code> 匹配 任何小写字母 或 任何十进制数字.  <br />
N.b., class 不应该作为 range 的边界.
</p>

<p>
在 ‘​<code>[...]</code>​’ 中, 只有如下字符是 special 的<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>:
</p>
<ul class="org-ul">
<li>‘​<code>]</code>​’ <br />
为了包含 ‘​<code>]</code>​’ 以匹配这个字符, 将其写在最前端: <code>[]123]</code>.</li>
<li>‘​<code>^</code>​’ <br />
仅当它是第一个字符时是 special 的, 此时, 它的后一个字符被看作是整个 ‘​<code>[^...]</code>​’ 的最前端.  <br />
为了包含它, 将其放在除了最前端以外的任何位置: <code>[12^ab]</code>.</li>
<li>‘​<code>-</code>​’ <br />
为了包含它, 将其写在尾端: <code>[123-]</code>.</li>
</ul>
<p>
因此, <code>[]^-]</code> 匹配以上三个字符.
</p>
</div>
</div>

<div id="outline-container-orgb1d2405" class="outline-4">
<h4 id="orgb1d2405"><span class="section-number-4">1.1.6.</span> ‘​<code>^</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span>&#xa0;<span class="matches_empty_string">matches_empty_string</span></span></h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
匹配 string 的 <b>行首</b> (或 buffer<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> 中可访问部分的起始端).
</p>

<p>
为了向后兼容 (historical compatibility), ‘​<code>^</code>​’ 只能用在:
</p>
<ul class="org-ul">
<li>Regexp 的开头.</li>
<li>接在 <a href="#org1eb9459">‘​<code>\(</code>​’</a> 或 <a href="#org2f25296">‘​<code>\(?:</code>​’</a> 后面.</li>
<li>接在 <a href="#orge14c7cc">‘​<code>\|</code>​’</a> 后面.</li>
</ul>
</div>
</div>
