docs/Emacs-regexp.org
*** ‘​=\=​’                                                         :construct:

有两个功能:
- 转义 [[Special Characters][special 字符]].
- 引入[[Backslash Constructs][额外的 special constructs]].

** Character Classes

Character classes 被用在 [[‘​=\[...\]=​’][‘​=[...]=​’]] 中.

*** ‘​=[:ascii:]=​’, ‘​=[:nonascii:]=​’

前者匹配任何 ASCII 字符[fn::Character which codes 0~127.];
后者相当于 =[^[:ascii:]]=.

*** ‘​=[:alnum:]=​’

匹配 任何字母 或 十进制数字.

若 multibyte (多字节) 字符的 Unicode ‘general-category’[fn:Unicode:详见 Unicode 标准.] property (see [[info:elisp#Character Properties][Character Properties]]) 指示该字符是字母 (alphabetic character), 那么也会被匹配.

*** ‘​=[:alpha:]=​’

类似于 [[‘​=\[:alnum:\]=​’][‘​=[:alnum:]=​’]], 但只匹配字母.

*** ‘​=[:blank:]=​’

匹配水平的空白字符 (horizontal whitespace[fn::Defined by Annex C of the Unicode Technical Standard #18.[fn:Unicode]]).

具体地, 它匹配:
- 空格, tab.
- 那些 其 Unicode ‘general-category’[fn:Unicode] property (see [[info:elisp#Character Properties][Character Properties]]) 指示其为 spacing separator 的字符.

*** ‘​=[:cntrl:]=​’

匹配字符 whose code is in the range 0~31.

*** ‘​=[:digit:]=​’

匹配数字 =0= 到 =9=.

*** ‘​=[:graph:]=​’

匹配图形化字符, IOW, everything *except*:
- [[‘​=\[:space:\]=​’][whitespace]].
- ASCII and non-ASCII control characters.
- surrogates[fn::与 UTF-16 有关.[fn:Unicode]].
- 没有被 Unicode 分配的码点, 正如 Unicode ‘general-category’[fn:Unicode] property (see [[info:elisp#Character Properties][Character Properties]]) 所指示的那样.

*** ‘​=[:lower:]=​’, ‘​=[:upper:]=​’

前者匹配小写字母[fn:Case-Table:As determined by the current case table (see [[info:elisp#The Case Table][The Case Table]]).[fn:Emacs]];
后者匹配大写字母.

*** ‘​=[:multibyte:]=​’, ‘​=[:unibyte:]=​’

分别匹配 multibyte (多字节) 和 unibyte (单字节) 字符 (see [[info:elisp#Text Representations][Text Representations]]).

*** ‘​=[:print:]=​’

匹配可打印字符.
相当于 =[=​[[‘​=\[:space:\]=​’][=[:space:]=]][[‘​=\[:graph:\]=​’][=[:graph:]=]]​=]=.

*** ‘​=[:punct:]=​’

匹配标点符号.
(At present, for multibyte characters, it matches anything that has non-[[‘​=\w=​’, ‘​=\W=​’][word syntax]].[fn:Emacs])

*** ‘​=[:space:]=​’

匹配[[‘​=\s=​/=code=/​’, ‘​=\S=​/=code=/​’][符合 whitespace syntax 的字符]] (see [[info:elisp#Table of Syntax Classes][Table of Syntax Classes]]).
IOW, 等价于 =\s-=.

*** ‘​=[:word:]=​’

匹配[[‘​=\s=​/=code=/​’, ‘​=\S=​/=code=/​’][符合 word syntax 的字符]] (see [[info:elisp#Table of Syntax Classes][Table of Syntax Classes]]).
IOW, 等价于 =\sw=.

*** ‘​=[:xdigit:]=​’

匹配 16 进制数字.
相当于 =[=​[[‘​=\[:digit:\]=​’][[:digit:]]]​=A-Fa-f]=.

** Backslash Constructs

大部分情况下, ‘​=\=​’ 后接的字符将精确匹配该字符自身.
然而 例外是: 一些特定的序列, 它们以 [[‘​=\=​’][‘​=\=​’]] 打头, 有特殊的含义.

*** ‘​=\|=​’

逻辑或.

‘​=\|=​’ 使用尽可能大的 regexp, e.g., =ab\|12= 匹配 _=ab= 或 =12=_ 而不是 _=ab2= 或 =a12=_.  \\
可以用 [[‘​=\(...\)=​’][‘​=\(...\)=​’]] 限制 ‘​=\|=​’ 的作用范围.

*** ‘​=\{=​/=m=/​=\}=​’

类似于 [[‘​=*=​’][‘​=*=​’]], 但 /精确/ 匹配 /m/ 次.

*** ‘​=\{=​/=m=/​,​/=n=/​=\}=​’

类似于 [[‘​=*=​’][‘​=*=​’]], 但匹配 /m/​~​/n/ 次.

/m/ 缺省为 0;
省略 /n/ 意为 \infty.

*** ‘​=\(...\)=​’                                                       :group:

有三个功能:
- 限制 [[‘​=\|=​’][‘​=\|=​’]] 的范围.  \\
  E.g., =a\(1\|2\)b= 匹配 _=a1b= 或 =a2b=_ 而不是 _=a1= 或 =2b=_.
- 包裹一个复合的表达式, 以使其作为整体附上 postfix operator.  \\
  E.g., =\(1\|2\)\{2\}= 匹配 _=11= 或 =12= 或 =21= 或 =22=_.
- 标记相应的被匹配的 substring, 为其分配一个编号, 以供将来用 [[‘​=\=​/=digit=/​’][‘​=\=​/=digit=/​’]] 引用 (reference).

*** ‘​=\(?:...\)=​’, ‘​=\(?=​/=num=/​=:...\)=​’                             :group:

前者被称为 /shy group/, 又名 /non-capturing/ 或 /unnumbered group/.  \\
类似于 [[‘​=\(...\)=​’][‘​=\(...\)=​’]], 但不标记被匹配的 substring, 因此无法被 [[‘​=\=​/=digit=/​’][‘​=\=​/=digit=/​’]] 引用 (refer back).

后者被称为 /explicitly numbered group/.  \\
显式地给被匹配的 substring 分配的一个编号.

*** ‘​=\=​/=digit=/​’
**** /=digit=/ 是如何分配的?

Regexp 中的 [[‘​=\(...\)=​’][‘​=\(...\)=​’]] 会按出现的顺序 (只看顺序, 所以嵌套的 [[‘​=\(...\)=​’][‘​=\(...\)=​’]] 能被识别), 被隐式地分配一个编号 (使用序数词, i.e., 从 1 开始); \\
若有必要, [[‘​=\(?:...\)=​’, ‘​=\(?=​/=num=/​=:...\)=​’][‘​=\(?=​/=num=/​=:...\)=​’]] 会覆盖已经存在的编号 /=num=/; \\
每次被隐式分配的编号, 会比先前已经分配的最大编号大 1.

如果类似 [[‘​=\(...\)=​’][‘​=\(...\)=​’]] 这样的结构被重复了多次 (e.g., =\(a\|b\)+=), 则仅为最后一次匹配的 substring 分配编号.

N.b., 编号只分配到个位数, 分完即止.
当然你可以用 [[‘​=\(?:...\)=​’, ‘​=\(?=​/=num=/​=:...\)=​’][‘​=\(?=​/=num=/​=:...\)=​’]] 显式地覆盖.

