docs/pages/Emacs-regexp.html

<div id="outline-container-orgeb3d459" class="outline-4">
<h4 id="orgeb3d459"><span class="section-number-4">1.1.7.</span> ‘​<code>$</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span>&#xa0;<span class="matches_empty_string">matches_empty_string</span></span></h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
类似于 <a href="#orgb1d2405">‘​<code>^</code>​’</a>, 但是是用来匹配 <b>行尾</b>.
</p>

<p>
为了向后兼容, 只能用在:
</p>
<ul class="org-ul">
<li>Regexp 的末尾.</li>
<li>接在 <a href="#org1eb9459">‘​<code>\)</code>​’</a> 后面.</li>
<li>接在 <a href="#orge14c7cc">‘​<code>\|</code>​’</a> 后面.</li>
</ul>
</div>
</div>

<div id="outline-container-org4b21883" class="outline-4">
<h4 id="org4b21883"><span class="section-number-4">1.1.8.</span> ‘​<code>\</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="construct">construct</span></span></h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
有两个功能:
</p>
<ul class="org-ul">
<li>转义 <a href="#orga8761e7">special 字符</a>.</li>
<li>引入<a href="#orgbd79821">额外的 special constructs</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6d328b4" class="outline-3">
<h3 id="org6d328b4"><span class="section-number-3">1.2.</span> Character Classes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Character classes 被用在 <a href="#orga9232fd">‘​<code>[...]</code>​’</a> 中.
</p>
</div>

<div id="outline-container-orgaa6ab20" class="outline-4">
<h4 id="orgaa6ab20"><span class="section-number-4">1.2.1.</span> ‘​<code>[:ascii:]</code>​’, ‘​<code>[:nonascii:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
前者匹配任何 ASCII 字符<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>;
后者相当于 <code>[^[:ascii:]]</code>.
</p>
</div>
</div>

<div id="outline-container-org0ac51fc" class="outline-4">
<h4 id="org0ac51fc"><span class="section-number-4">1.2.2.</span> ‘​<code>[:alnum:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
匹配 任何字母 或 十进制数字.
</p>

<p>
若 multibyte (多字节) 字符的 Unicode ‘general-category’<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup> property (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Character-Properties">Character Properties</a>) 指示该字符是字母 (alphabetic character), 那么也会被匹配.
</p>
</div>
</div>

<div id="outline-container-orgdc418f7" class="outline-4">
<h4 id="orgdc418f7"><span class="section-number-4">1.2.3.</span> ‘​<code>[:alpha:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
类似于 <a href="#org0ac51fc">‘​<code>[:alnum:]</code>​’</a>, 但只匹配字母.
</p>
</div>
</div>

<div id="outline-container-org3d48354" class="outline-4">
<h4 id="org3d48354"><span class="section-number-4">1.2.4.</span> ‘​<code>[:blank:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
匹配水平的空白字符 (horizontal whitespace<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>).
</p>

<p>
具体地, 它匹配:
</p>
<ul class="org-ul">
<li>空格, tab.</li>
<li>那些 其 Unicode ‘general-category’<sup><a id="fnr.7.100" class="footref" href="#fn.7" role="doc-backlink">7</a></sup> property (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Character-Properties">Character Properties</a>) 指示其为 spacing separator 的字符.</li>
</ul>
</div>
</div>

<div id="outline-container-org8c5ad1f" class="outline-4">
<h4 id="org8c5ad1f"><span class="section-number-4">1.2.5.</span> ‘​<code>[:cntrl:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
匹配字符 whose code is in the range 0~31.
</p>
</div>
</div>

<div id="outline-container-orgb113260" class="outline-4">
<h4 id="orgb113260"><span class="section-number-4">1.2.6.</span> ‘​<code>[:digit:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
匹配数字 <code>0</code> 到 <code>9</code>.
</p>
</div>
</div>

<div id="outline-container-orge127233" class="outline-4">
<h4 id="orge127233"><span class="section-number-4">1.2.7.</span> ‘​<code>[:graph:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
匹配图形化字符, IOW, everything <b>except</b>:
</p>
<ul class="org-ul">
<li><a href="#orgdf3d1d8">whitespace</a>.</li>
<li>ASCII and non-ASCII control characters.</li>
<li>surrogates<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>.</li>
<li>没有被 Unicode 分配的码点, 正如 Unicode ‘general-category’<sup><a id="fnr.7.100" class="footref" href="#fn.7" role="doc-backlink">7</a></sup> property (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Character-Properties">Character Properties</a>) 所指示的那样.</li>
</ul>
</div>
</div>

<div id="outline-container-org8f9309e" class="outline-4">
<h4 id="org8f9309e"><span class="section-number-4">1.2.8.</span> ‘​<code>[:lower:]</code>​’, ‘​<code>[:upper:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-8">
<p>
前者匹配小写字母<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>;
后者匹配大写字母.
</p>
</div>
</div>

<div id="outline-container-org7a72b5d" class="outline-4">
<h4 id="org7a72b5d"><span class="section-number-4">1.2.9.</span> ‘​<code>[:multibyte:]</code>​’, ‘​<code>[:unibyte:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-9">
<p>
分别匹配 multibyte (多字节) 和 unibyte (单字节) 字符 (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Text-Representations">Text Representations</a>).
</p>
</div>
</div>

<div id="outline-container-org4f00da8" class="outline-4">
<h4 id="org4f00da8"><span class="section-number-4">1.2.10.</span> ‘​<code>[:print:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-10">
<p>
匹配可打印字符.
相当于 <code>[</code>​<a href="#orgdf3d1d8"><code>[:space:]</code></a><a href="#orge127233"><code>[:graph:]</code></a>​<code>]</code>.
</p>
</div>
</div>

<div id="outline-container-orgbde43e0" class="outline-4">
<h4 id="orgbde43e0"><span class="section-number-4">1.2.11.</span> ‘​<code>[:punct:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-11">
<p>
匹配标点符号.
(At present, for multibyte characters, it matches anything that has non-<a href="#org604d180">word syntax</a>.<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>)
</p>
</div>
</div>

<div id="outline-container-orgdf3d1d8" class="outline-4">
<h4 id="orgdf3d1d8"><span class="section-number-4">1.2.12.</span> ‘​<code>[:space:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-12">
<p>
匹配<a href="#org519697b">符合 whitespace syntax 的字符</a> (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Table-of-Syntax-Classes">Table of Syntax Classes</a>).
IOW, 等价于 <code>\s-</code>.
</p>
</div>
</div>

<div id="outline-container-orgac4d3d5" class="outline-4">
<h4 id="orgac4d3d5"><span class="section-number-4">1.2.13.</span> ‘​<code>[:word:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-13">
<p>
匹配<a href="#org519697b">符合 word syntax 的字符</a> (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Table-of-Syntax-Classes">Table of Syntax Classes</a>).
IOW, 等价于 <code>\sw</code>.
</p>
</div>
</div>

<div id="outline-container-org2c88999" class="outline-4">
<h4 id="org2c88999"><span class="section-number-4">1.2.14.</span> ‘​<code>[:xdigit:]</code>​’</h4>
<div class="outline-text-4" id="text-1-2-14">
<p>
匹配 16 进制数字.
相当于 <code>[</code>​<a href="#orgb113260">[:digit:</a>]​<code>A-Fa-f]</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbd79821" class="outline-3">
<h3 id="orgbd79821"><span class="section-number-3">1.3.</span> Backslash Constructs</h3>
<div class="outline-text-3" id="text-1-3">
<p>
大部分情况下, ‘​<code>\</code>​’ 后接的字符将精确匹配该字符自身.
然而 例外是: 一些特定的序列, 它们以 <a href="#org4b21883">‘​<code>\</code>​’</a> 打头, 有特殊的含义.
</p>
</div>

<div id="outline-container-orge14c7cc" class="outline-4">
<h4 id="orge14c7cc"><span class="section-number-4">1.3.1.</span> ‘​<code>\|</code>​’</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
逻辑或.
</p>

<p>
‘​<code>\|</code>​’ 使用尽可能大的 regexp, e.g., <code>ab\|12</code> 匹配 <span class="underline"><code>ab</code> 或 <code>12</code></span> 而不是 <span class="underline"><code>ab2</code> 或 <code>a12</code></span>.  <br />
可以用 <a href="#org1eb9459">‘​<code>\(...\)</code>​’</a> 限制 ‘​<code>\|</code>​’ 的作用范围.
</p>
</div>
</div>

<div id="outline-container-org32a09a0" class="outline-4">
<h4 id="org32a09a0"><span class="section-number-4">1.3.2.</span> ‘​<code>\{</code>​<i><code>m</code></i>​<code>\}</code>​’</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
类似于 <a href="#orgb841519">‘​<code>*</code>​’</a>, 但 <i>精确</i> 匹配 <i>m</i> 次.
</p>
</div>
</div>

<div id="outline-container-orgb9af621" class="outline-4">
<h4 id="orgb9af621"><span class="section-number-4">1.3.3.</span> ‘​<code>\{</code>​<i><code>m</code></i>​,​<i><code>n</code></i>​<code>\}</code>​’</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
类似于 <a href="#orgb841519">‘​<code>*</code>​’</a>, 但匹配 <i>m</i>​~​<i>n</i> 次.
</p>

<p>
<i>m</i> 缺省为 0;
省略 <i>n</i> 意为 &infin;.
</p>
</div>
</div>

<div id="outline-container-org1eb9459" class="outline-4">
<h4 id="org1eb9459"><span class="section-number-4">1.3.4.</span> ‘​<code>\(...\)</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="group">group</span></span></h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
有三个功能:
</p>
<ul class="org-ul">
<li>限制 <a href="#orge14c7cc">‘​<code>\|</code>​’</a> 的范围.  <br />
E.g., <code>a\(1\|2\)b</code> 匹配 <span class="underline"><code>a1b</code> 或 <code>a2b</code></span> 而不是 <span class="underline"><code>a1</code> 或 <code>2b</code></span>.</li>
<li>包裹一个复合的表达式, 以使其作为整体附上 postfix operator.  <br />
E.g., <code>\(1\|2\)\{2\}</code> 匹配 <span class="underline"><code>11</code> 或 <code>12</code> 或 <code>21</code> 或 <code>22</code></span>.</li>
<li>标记相应的被匹配的 substring, 为其分配一个编号, 以供将来用 <a href="#orgc300926">‘​<code>\</code>​<i><code>digit</code></i>​’</a> 引用 (reference).</li>
</ul>
</div>
</div>

<div id="outline-container-org2f25296" class="outline-4">
<h4 id="org2f25296"><span class="section-number-4">1.3.5.</span> ‘​<code>\(?:...\)</code>​’, ‘​<code>\(?</code>​<i><code>num</code></i>​<code>:...\)</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="group">group</span></span></h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
前者被称为 <i>shy group</i>, 又名 <i>non-capturing</i> 或 <i>unnumbered group</i>.  <br />
类似于 <a href="#org1eb9459">‘​<code>\(...\)</code>​’</a>, 但不标记被匹配的 substring, 因此无法被 <a href="#orgc300926">‘​<code>\</code>​<i><code>digit</code></i>​’</a> 引用 (refer back).
</p>

<p>
后者被称为 <i>explicitly numbered group</i>.  <br />
显式地给被匹配的 substring 分配的一个编号.
</p>
</div>
</div>

<div id="outline-container-orgc300926" class="outline-4">
<h4 id="orgc300926"><span class="section-number-4">1.3.6.</span> ‘​<code>\</code>​<i><code>digit</code></i>​’</h4>
<div class="outline-text-4" id="text-1-3-6">
</div>
<ol class="org-ol">
<li><a id="orgdad246f"></a><i><code>digit</code></i> 是如何分配的?<br />
<div class="outline-text-5" id="text-1-3-6-1">
<p>
Regexp 中的 <a href="#org1eb9459">‘​<code>\(...\)</code>​’</a> 会按出现的顺序 (只看顺序, 所以嵌套的 <a href="#org1eb9459">‘​<code>\(...\)</code>​’</a> 能被识别), 被隐式地分配一个编号 (使用序数词, i.e., 从 1 开始); <br />
若有必要, <a href="#org2f25296">‘​<code>\(?</code>​<i><code>num</code></i>​<code>:...\)</code>​’</a> 会覆盖已经存在的编号 <i><code>num</code></i>; <br />
每次被隐式分配的编号, 会比先前已经分配的最大编号大 1.
</p>

<p>
如果类似 <a href="#org1eb9459">‘​<code>\(...\)</code>​’</a> 这样的结构被重复了多次 (e.g., <code>\(a\|b\)+</code>), 则仅为最后一次匹配的 substring 分配编号.
</p>

<p>
N.b., 编号只分配到个位数, 分完即止.
当然你可以用 <a href="#org2f25296">‘​<code>\(?</code>​<i><code>num</code></i>​<code>:...\)</code>​’</a> 显式地覆盖.
</p>
</div>
</li>
