docs/Emacs-regexp.org
**** 如何引用先前已经匹配的 substring?

例如, =\(.+\)\1= 匹配同一行[fn::[[‘​=.=​’][‘​=.=​’]] 不匹配 newline.]中前半段与后半段一致的非空 string.

若 /=digit=/ 没有被分配, 则 =\=​/=digit=/ 永不匹配.  \\
例如 =\(one\(two\)\|three\)\2= 永远不会匹配 =three=, 因为当尝试匹配 =three= 时, 表达式中已经没有剩余的 [[‘​=\(...\)=​’][‘​=\(...\)=​’]] 了, 则代表永不匹配的 =\2= 会直接导致匹配失败:
#+BEGIN_SRC emacs-lisp
(string-match-p "\\(one\\(two\\)\\|three\\)\\2" "three")
;; => nil
#+END_SRC
但该表达式可以匹配 =onetwotwo=:
#+BEGIN_SRC emacs-lisp
(string-match-p "\\(one\\(two\\)\\|three\\)\\2" "onetwotwo")
;; => 0
#+END_SRC

*** ‘​=\w=​’, ‘​=\W=​’

前者匹配 [[‘​=\[:word:\]=​’][word-constituent (位于单词中的) 字符]].
(The editor syntax table determines which characters these are.  See [[info:elisp#Syntax Tables][Syntax Tables]].)[fn:Emacs]

后者是前者的补集.

*** ‘​=\s=​/=code=/​’, ‘​=\S=​/=code=/​’

前者匹配符合 /=code=/ syntax 的字符 (see [[info:elisp#Table of Syntax Classes][Table of Syntax Classes]]).[fn:Emacs]  \\
因此, /=code=/ 处填写
- ‘​=w=​’ 以匹配 [[‘​=\w=​’, ‘​=\W=​’][word constituent]].
  等价于 [[‘​=\[:word:\]=​’][=:word:=]].
- ‘​=-=​’ (或 一个空格) 以匹配 whitespace.
  等价于 [[‘​=\[:space:\]=​’][=:space:=]].
- ‘​=(=​’ 以匹配 open parenthesis.
- etc.

后者是前者的补集.

*** ‘​=\c=​/=c=/​’, ‘​=\C=​/=c=/​’

前者匹配 whose category is /=c=/ 的字符 (see [[info:elisp#Categories][Categories]]).[fn:Emacs]  \\
因此, /=c=/ 处填写
- ‘​=c=​’ 以匹配 汉字.
- ‘​=g=​’ 以匹配 希腊字母.
- etc.

后者是前者的补集.

*** ‘​=\`=​’, ‘​=\'=​’                                     :matches_empty_string:

分别匹配 string 或 buffer[fn:Emacs] 的 *开头* 和 *结尾*.

*** ‘​=\==​’                                             :matches_empty_string:

匹配 point.[fn:Emacs]
(This construct is not defined when matching against a string.)

*** ‘​=\b=​’, ‘​=\B=​’                                     :matches_empty_string:

前者匹配 单词的边界处 或 buffer[fn:Emacs] 的首尾;  \\
后者则相反.

*** ‘​=\<=​’, ‘​=\>=​’                                     :matches_empty_string:

分别匹配 单词 的 起始端 和 结束端.

*** ‘​=\_<=​’, ‘​=\_>=​’                                   :matches_empty_string:

分别匹配 symbol 的 起始端 和 结束端.
(A symbol is a sequence of one or more word or symbol-constituent characters.)

* 一个复杂的例子

如下是 Emacs 曾经用来匹配 句尾 (可能尾随 whitespace) 的 regexp:
    : [.?!][]'")}]*\($\| $\|Tab\|  \)[ TabNewline]*
其中, 空白处指代空格, =Tab= 指代 tab 字符 =\t=, =Newline= 指代 newline 字符 =\n=.

这个例子可以用 [[~rx~\[fn:Emacs\]: 结构化 regexp 标记法][~rx~]] 标记法编写:
#+BEGIN_SRC emacs-lisp
(rx (any ".?!")                    ; [.?!]
    (zero-or-more (any "]'\")}"))  ; []'")}]*
    (or line-end                   ; \($
        (seq " " line-end)         ;    \| $
        "\t"                       ;        \|Tab
        "  ")                      ;             \|  \)
    (zero-or-more (any " \t\n")))  ; [ TabNewline]*
#+END_SRC

* ~rx~[fn:Emacs]: 结构化 regexp 标记法

由于 ~rx~ 基于 S-表达式[fn::前缀式语法树.], 因此它更易读, 可以 被格式化 和 注释.

例如以下用于匹配 C 语言 块注释 的 regexp, 可被改写成两种同义的 ~rx~ 表达式:
#+BEGIN_SRC emacs-lisp
;; /\*\(?:[^*]\|\*[^/]\)*\*+/
"/\\*\\(?:[^*]\\|\\*[^/]\\)*\\*+/"

(rx "/*"
    (zero-or-more (or (not (any "*"))
                      (seq "*"
                           (not (any "/")))))
    (one-or-more "*")
    "/")

(rx "/*"
    (* (| (not "*")
          (: "*"
             (not "/"))))
    (+ "*")
    "/")
#+END_SRC

** Constructs in ~rx~

(剩下的有空再写吧...)

*** Literals

*** Sequence and alternative

*** Repetition

*** Matching single characters

*** Character class

*** Zero-width assertions

*** Capture groups

*** Dynamic inclusion

** Functions & macros [fn:Emacs] using ~rx~

*** ~rx~ /~&rest~ ~rx-form~/                                          :macro:

*** ~rx-to-string~ /~rx-expr~ ~&optional~ ~no-group~/              :function:

*** ~pcase~ ~expression~ ~((rx~ /~rx-expr~/​~...)~ ~body-forms...)...~ :macro:

* 相关函数[fn:Emacs]

期望被传入 regexp 的函数在接收到 invalid regexp 时, 会 signal 一个 ~invalid-regexp~ error.

*** ~regexp-quote~ /~string~/                                      :function:

将 literal string 转换成 regexp.
E.g.,
    : (regexp-quote ".")  ; => "\\."

*** ~regexp-opt~ /~strings~ ~&optional~ ~paren~/                   :function:

/~strings~/ 是由 literal string 为元素组成的 list.
该函数相当于逻辑或, 但是它希望返回的 regexp 匹配得尽可能长, e.g.,
#+BEGIN_SRC emacs-lisp
(regexp-opt '("23"
              "1"
              "123"))
;; => "\\(?:1\\(?:23\\)?\\|23\\)"
;; i.e., \(?:1\(?:23\)?\|23\)
#+END_SRC
虽然按照 /~strings~/ 的想法, 遇到 =1= 就可以结束尝试了, 但根据 ~regexp-opt~ 的结果来看, 还会继续尝试下个 substring 是不是 =23=.

