docs/pages/Emacs-regexp.html

<li><a id="orge960e94"></a>如何引用先前已经匹配的 substring?<br />
<div class="outline-text-5" id="text-1-3-6-2">
<p>
例如, <code>\(.+\)\1</code> 匹配同一行<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>中前半段与后半段一致的非空 string.
</p>

<p>
若 <i><code>digit</code></i> 没有被分配, 则 <code>\</code>​<i><code>digit</code></i> 永不匹配.  <br />
例如 <code>\(one\(two\)\|three\)\2</code> 永远不会匹配 <code>three</code>, 因为当尝试匹配 <code>three</code> 时, 表达式中已经没有剩余的 <a href="#org1eb9459">‘​<code>\(...\)</code>​’</a> 了, 则代表永不匹配的 <code>\2</code> 会直接导致匹配失败:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(string-match-p "\\(one\\(two\\)\\|three\\)\\2" "three")
;; =&gt; nil
</pre>
</div>
<p>
但该表达式可以匹配 <code>onetwotwo</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(string-match-p "\\(one\\(two\\)\\|three\\)\\2" "onetwotwo")
;; =&gt; 0
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org604d180" class="outline-4">
<h4 id="org604d180"><span class="section-number-4">1.3.7.</span> ‘​<code>\w</code>​’, ‘​<code>\W</code>​’</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
前者匹配 <a href="#orgac4d3d5">word-constituent (位于单词中的) 字符</a>.
(The editor syntax table determines which characters these are.  See <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Syntax-Tables">Syntax Tables</a>.)<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>
</p>

<p>
后者是前者的补集.
</p>
</div>
</div>

<div id="outline-container-org519697b" class="outline-4">
<h4 id="org519697b"><span class="section-number-4">1.3.8.</span> ‘​<code>\s</code>​<i><code>code</code></i>​’, ‘​<code>\S</code>​<i><code>code</code></i>​’</h4>
<div class="outline-text-4" id="text-1-3-8">
<p>
前者匹配符合 <i><code>code</code></i> syntax 的字符 (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Table-of-Syntax-Classes">Table of Syntax Classes</a>).<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>  <br />
因此, <i><code>code</code></i> 处填写
</p>
<ul class="org-ul">
<li>‘​<code>w</code>​’ 以匹配 <a href="#org604d180">word constituent</a>.
等价于 <a href="#orgac4d3d5"><code>:word:</code></a>.</li>
<li>‘​<code>-</code>​’ (或 一个空格) 以匹配 whitespace.
等价于 <a href="#orgdf3d1d8"><code>:space:</code></a>.</li>
<li>‘​<code>(</code>​’ 以匹配 open parenthesis.</li>
<li>etc.</li>
</ul>

<p>
后者是前者的补集.
</p>
</div>
</div>

<div id="outline-container-org698e339" class="outline-4">
<h4 id="org698e339"><span class="section-number-4">1.3.9.</span> ‘​<code>\c</code>​<i><code>c</code></i>​’, ‘​<code>\C</code>​<i><code>c</code></i>​’</h4>
<div class="outline-text-4" id="text-1-3-9">
<p>
前者匹配 whose category is <i><code>c</code></i> 的字符 (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Categories">Categories</a>).<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>  <br />
因此, <i><code>c</code></i> 处填写
</p>
<ul class="org-ul">
<li>‘​<code>c</code>​’ 以匹配 汉字.</li>
<li>‘​<code>g</code>​’ 以匹配 希腊字母.</li>
<li>etc.</li>
</ul>

<p>
后者是前者的补集.
</p>
</div>
</div>

<div id="outline-container-org868ae02" class="outline-4">
<h4 id="org868ae02"><span class="section-number-4">1.3.10.</span> ‘​<code>\`</code>​’, ‘​<code>\'</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></h4>
<div class="outline-text-4" id="text-1-3-10">
<p>
分别匹配 string 或 buffer<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> 的 <b>开头</b> 和 <b>结尾</b>.
</p>
</div>
</div>

<div id="outline-container-org262cb01" class="outline-4">
<h4 id="org262cb01"><span class="section-number-4">1.3.11.</span> ‘​<code>\=</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></h4>
<div class="outline-text-4" id="text-1-3-11">
<p>
匹配 point.<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>
(This construct is not defined when matching against a string.)
</p>
</div>
</div>

<div id="outline-container-org1d0e6d8" class="outline-4">
<h4 id="org1d0e6d8"><span class="section-number-4">1.3.12.</span> ‘​<code>\b</code>​’, ‘​<code>\B</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></h4>
<div class="outline-text-4" id="text-1-3-12">
<p>
前者匹配 单词的边界处 或 buffer<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> 的首尾;  <br />
后者则相反.
</p>
</div>
</div>

<div id="outline-container-org6ccb0de" class="outline-4">
<h4 id="org6ccb0de"><span class="section-number-4">1.3.13.</span> ‘​<code>\&lt;</code>​’, ‘​<code>\&gt;</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></h4>
<div class="outline-text-4" id="text-1-3-13">
<p>
分别匹配 单词 的 起始端 和 结束端.
</p>
</div>
</div>

<div id="outline-container-org89ee492" class="outline-4">
<h4 id="org89ee492"><span class="section-number-4">1.3.14.</span> ‘​<code>\_&lt;</code>​’, ‘​<code>\_&gt;</code>​’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="matches_empty_string">matches_empty_string</span></span></h4>
<div class="outline-text-4" id="text-1-3-14">
<p>
分别匹配 symbol 的 起始端 和 结束端.
(A symbol is a sequence of one or more word or symbol-constituent characters.)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org2762395" class="outline-2">
<h2 id="org2762395"><span class="section-number-2">2.</span> 一个复杂的例子</h2>
<div class="outline-text-2" id="text-2">
<p>
如下是 Emacs 曾经用来匹配 句尾 (可能尾随 whitespace) 的 regexp:
</p>
<pre class="example">
[.?!][]'")}]*\($\| $\|Tab\|  \)[ TabNewline]*
</pre>

<p>
其中, 空白处指代空格, <code>Tab</code> 指代 tab 字符 <code>\t</code>, <code>Newline</code> 指代 newline 字符 <code>\n</code>.
</p>

<p>
这个例子可以用 <a href="#org3a5c963"><code>rx</code></a> 标记法编写:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(rx (any ".?!")                    ; [.?!]
    (zero-or-more (any "]'\")}"))  ; []'")}]*
    (or line-end                   ; \($
        (seq " " line-end)         ;    \| $
        "\t"                       ;        \|Tab
        "  ")                      ;             \|  \)
    (zero-or-more (any " \t\n")))  ; [ TabNewline]*
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a5c963" class="outline-2">
<h2 id="org3a5c963"><span class="section-number-2">3.</span> <code>rx</code><sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>: 结构化 regexp 标记法</h2>
<div class="outline-text-2" id="text-3">
<p>
由于 <code>rx</code> 基于 S-表达式<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>, 因此它更易读, 可以 被格式化 和 注释.
</p>

<p>
例如以下用于匹配 C 语言 块注释 的 regexp, 可被改写成两种同义的 <code>rx</code> 表达式:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; /\*\(?:[^*]\|\*[^/]\)*\*+/
"/\\*\\(?:[^*]\\|\\*[^/]\\)*\\*+/"

(rx "/*"
    (zero-or-more (or (not (any "*"))
                      (seq "*"
                           (not (any "/")))))
    (one-or-more "*")
    "/")

(rx "/*"
    (* (| (not "*")
          (: "*"
             (not "/"))))
    (+ "*")
    "/")
</pre>
</div>
</div>

<div id="outline-container-orga85d0af" class="outline-3">
<h3 id="orga85d0af"><span class="section-number-3">3.1.</span> Constructs in <code>rx</code></h3>
<div class="outline-text-3" id="text-3-1">
<p>
(剩下的有空再写吧&#x2026;)
</p>
</div>

<div id="outline-container-org4f43534" class="outline-4">
<h4 id="org4f43534"><span class="section-number-4">3.1.1.</span> Literals</h4>
</div>

<div id="outline-container-orgf8b9ace" class="outline-4">
<h4 id="orgf8b9ace"><span class="section-number-4">3.1.2.</span> Sequence and alternative</h4>
</div>

<div id="outline-container-org454e95d" class="outline-4">
<h4 id="org454e95d"><span class="section-number-4">3.1.3.</span> Repetition</h4>
</div>

<div id="outline-container-orgac4047d" class="outline-4">
<h4 id="orgac4047d"><span class="section-number-4">3.1.4.</span> Matching single characters</h4>
</div>

<div id="outline-container-org68b55f5" class="outline-4">
<h4 id="org68b55f5"><span class="section-number-4">3.1.5.</span> Character class</h4>
</div>

<div id="outline-container-org7b7ee0a" class="outline-4">
<h4 id="org7b7ee0a"><span class="section-number-4">3.1.6.</span> Zero-width assertions</h4>
</div>

<div id="outline-container-org53d3f47" class="outline-4">
<h4 id="org53d3f47"><span class="section-number-4">3.1.7.</span> Capture groups</h4>
</div>

<div id="outline-container-org9d75fc0" class="outline-4">
<h4 id="org9d75fc0"><span class="section-number-4">3.1.8.</span> Dynamic inclusion</h4>
</div>
</div>

<div id="outline-container-orgd6b4c3f" class="outline-3">
<h3 id="orgd6b4c3f"><span class="section-number-3">3.2.</span> Functions &amp; macros <sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> using <code>rx</code></h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org3db18b2" class="outline-4">
<h4 id="org3db18b2"><span class="section-number-4">3.2.1.</span> <code>rx</code> <i><code>&amp;rest</code> <code>rx-form</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="macro">macro</span></span></h4>
</div>

<div id="outline-container-org105529b" class="outline-4">
<h4 id="org105529b"><span class="section-number-4">3.2.2.</span> <code>rx-to-string</code> <i><code>rx-expr</code> <code>&amp;optional</code> <code>no-group</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></h4>
</div>

<div id="outline-container-org6b7e196" class="outline-4">
<h4 id="org6b7e196"><span class="section-number-4">3.2.3.</span> <code>pcase</code> <code>expression</code> <code>((rx</code> <i><code>rx-expr</code></i>​<code>...)</code> <code>body-forms...)...</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="macro">macro</span></span></h4>
</div>
</div>
</div>

<div id="outline-container-orgbe1f652" class="outline-2">
<h2 id="orgbe1f652"><span class="section-number-2">4.</span> 相关函数<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup></h2>
<div class="outline-text-2" id="text-4">
<p>
期望被传入 regexp 的函数在接收到 invalid regexp 时, 会 signal 一个 <code>invalid-regexp</code> error.
</p>
</div>

<div id="outline-container-orga17e237" class="outline-4">
<h4 id="orga17e237"><span class="section-number-4">4.0.1.</span> <code>regexp-quote</code> <i><code>string</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></h4>
<div class="outline-text-4" id="text-4-0-1">
<p>
将 literal string 转换成 regexp.
E.g.,
</p>
<pre class="example">
(regexp-quote ".")  ; =&gt; "\\."
</pre>
</div>
</div>

<div id="outline-container-org3770317" class="outline-4">
<h4 id="org3770317"><span class="section-number-4">4.0.2.</span> <code>regexp-opt</code> <i><code>strings</code> <code>&amp;optional</code> <code>paren</code></i>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="function">function</span></span></h4>
<div class="outline-text-4" id="text-4-0-2">
<p>
<i><code>strings</code></i> 是由 literal string 为元素组成的 list.
该函数相当于逻辑或, 但是它希望返回的 regexp 匹配得尽可能长, e.g.,
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(regexp-opt '("23"
              "1"
              "123"))
;; =&gt; "\\(?:1\\(?:23\\)?\\|23\\)"
;; i.e., \(?:1\(?:23\)?\|23\)
</pre>
</div>
<p>
虽然按照 <i><code>strings</code></i> 的想法, 遇到 <code>1</code> 就可以结束尝试了, 但根据 <code>regexp-opt</code> 的结果来看, 还会继续尝试下个 substring 是不是 <code>23</code>.
</p>
</div>
</div>
